publish/html/简单排序.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>简单排序</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-22 23:29:29 "/>
<meta name="author" content="emacsers"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">简单排序</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 如何排序 </a></li>
<li><a href="#sec-2">2 冒泡排序 </a>
<ul>
<li><a href="#sec-2-1">2.1 特点 </a></li>
<li><a href="#sec-2-2">2.2 思路 </a></li>
<li><a href="#sec-2-3">2.3 例子 </a></li>
<li><a href="#sec-2-4">2.4 效率 </a></li>
</ul>
</li>
<li><a href="#sec-3">3 选择排序 </a>
<ul>
<li><a href="#sec-3-1">3.1 特点 </a></li>
<li><a href="#sec-3-2">3.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-4">4 插入排序 </a>
<ul>
<li><a href="#sec-4-1">4.1 特点 </a></li>
<li><a href="#sec-4-2">4.2 例子 </a></li>
</ul>
</li>
<li><a href="#sec-5">5 对象排序 </a>
<ul>
<li><a href="#sec-5-1">5.1 特点 </a></li>
</ul>
</li>
<li><a href="#sec-6">6 简单排序比较 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 如何排序 </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>只能根据算法的比较原理
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 冒泡排序 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 特点 </h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>非常慢
</li>
<li>最简单
</li>
</ul>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 思路 </h3>
<div class="outline-text-3" id="text-2-2">

<ul>
<li>把最小的数据放在最左边 
</li>
</ul>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 例子 </h3>
<div class="outline-text-3" id="text-2-3">




<pre class="src src-java"> <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">long</span>[] <span style="color: #7fffd4; font-weight: bold;">a</span>;                 <span style="color: #add8e6;">// </span><span style="color: #add8e6;">ref to array a</span>
 <span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">nElems</span>; 

  <span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">bubbleSort</span>()
    {
    <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">out</span>, <span style="color: #7fffd4; font-weight: bold;">in</span>;

    <span style="color: #fa8072;">for</span>(out=nElems-1; out&gt;1; out--)   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">outer loop (backward)</span>
       <span style="color: #fa8072;">for</span>(in=0; in&lt;out; in++)        <span style="color: #add8e6;">// </span><span style="color: #add8e6;">inner loop (forward)</span>
          <span style="color: #fa8072;">if</span>( a[in] &gt; a[in+1] )       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">out of order?</span>
             swap(in, in+1);          <span style="color: #add8e6;">// </span><span style="color: #add8e6;">swap them</span>
    }

<span style="color: #fa8072;">private</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">swap</span>(<span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">one</span>, <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">two</span>)
    {
    <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = a[one];
    a[one] = a[two];
    a[two] = temp;
    }
</pre>



</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 效率 </h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>n<sup>2</sup>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 选择排序 </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 特点 </h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>交换次数 n
</li>
<li>比较次数 n<sup>2</sup>
</li>
</ul>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 例子 </h3>
<div class="outline-text-3" id="text-3-2">




<pre class="src src-java"><span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">selectionSort</span>()
    {
    <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">out</span>, <span style="color: #7fffd4; font-weight: bold;">in</span>, <span style="color: #7fffd4; font-weight: bold;">min</span>;

    <span style="color: #fa8072;">for</span>(out=0; out&lt;nElems-1; out++)   <span style="color: #add8e6;">// </span><span style="color: #add8e6;">outer loop</span>
       {
       min = out;                     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">minimum</span>
       <span style="color: #fa8072;">for</span>(in=out+1; in&lt;nElems; in++) <span style="color: #add8e6;">// </span><span style="color: #add8e6;">inner loop</span>
          <span style="color: #fa8072;">if</span>(a[in] &lt; a[min] )         <span style="color: #add8e6;">// </span><span style="color: #add8e6;">if min greater,</span>
              min = in;               <span style="color: #add8e6;">// </span><span style="color: #add8e6;">we have a new min</span>
       swap(out, min);                <span style="color: #add8e6;">// </span><span style="color: #add8e6;">swap them</span>
       }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end for(out)</span>
    }
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 插入排序 </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 特点 </h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>比冒泡排序快一倍
</li>
<li>比选择排序块
</li>
<li>更麻烦
</li>
</ul>

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 例子 </h3>
<div class="outline-text-3" id="text-4-2">




<pre class="src src-java"><span style="color: #fa8072;">public</span> <span style="color: #9acd32; font-weight: bold;">void</span> <span style="color: #7fffd4; font-weight: bold;">insertionSort</span>()
   {
   <span style="color: #9acd32; font-weight: bold;">int</span> <span style="color: #7fffd4; font-weight: bold;">in</span>, <span style="color: #7fffd4; font-weight: bold;">out</span>;

   <span style="color: #fa8072;">for</span>(out=1; out&lt;nElems; out++)     <span style="color: #add8e6;">// </span><span style="color: #add8e6;">out is dividing line</span>
      {
      <span style="color: #9acd32; font-weight: bold;">long</span> <span style="color: #7fffd4; font-weight: bold;">temp</span> = a[out];            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">remove marked item</span>
      in = out;                      <span style="color: #add8e6;">// </span><span style="color: #add8e6;">start shifts at out</span>
      <span style="color: #fa8072;">while</span>(in&gt;0 &amp;&amp; a[in-1] &gt;= temp) <span style="color: #add8e6;">// </span><span style="color: #add8e6;">until one is smaller,</span>
         {
         a[in] = a[in-1];            <span style="color: #add8e6;">// </span><span style="color: #add8e6;">shift item to right</span>
         --in;                       <span style="color: #add8e6;">// </span><span style="color: #add8e6;">go left one position</span>
         }
      a[in] = temp;                  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">insert marked item</span>
      }  <span style="color: #add8e6;">// </span><span style="color: #add8e6;">end for</span>
   }
</pre>



</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 对象排序 </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 特点 </h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>对象排序比较的是对象的某个属性
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 简单排序比较 </h2>
<div class="outline-text-2" id="text-6">

<ul>
<li>冒泡排序实用价值小
</li>
<li>数据量较小时,使用插入排序    
</li>
<li>大量数据时使用快速排序    
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-09-22 23:29:29 </p>
<p class="author">Author: emacsers</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
